; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v13 ?v12)
             (pred_5 ?v2 ?v8)
             (pred_6 ?v13 ?v8)
             (pred_8 ?v11 ?v13 )
	     (pred_10 ?v13)
             (pred_1 ?v6)
             (pred_7 ?v2)
             (pred_4 ?v8)
             (pred_11 ?v13)
             (pred_12 ?v2)
             (pred_3 ?v13)
             (pred_9 ))



(:action op_3
:parameters (?v10 ?v3 ?v9 ?v5)
:precondition (and (pred_1 ?v10) (pred_1 ?v3) (pred_7 ?v9) (pred_4 ?v5)
          (pred_2 ?v10 ?v3) (pred_5 ?v9 ?v5)
                   (pred_6 ?v3 ?v5) (pred_10 ?v10) 
                   (pred_11 ?v3) (pred_12 ?v9))
:effect (and  (pred_3 ?v3) (not (pred_11 ?v3))))


(:action op_2
:parameters (?v10 ?v1)
:precondition (and (pred_1 ?v10) (pred_1 ?v1)
               (pred_10 ?v10) (pred_2 ?v10 ?v1) (pred_3 ?v1))
:effect (and (pred_10 ?v1) (not (pred_10 ?v10))))

(:action op_1
:parameters (?v10 ?v9)
:precondition (and (pred_1 ?v10) (pred_7 ?v9) 
                  (pred_10 ?v10) (pred_8 ?v9 ?v10) (pred_9 ))
:effect (and (pred_12 ?v9)
   (not (pred_8 ?v9 ?v10)) (not (pred_9 ))))


(:action op_4
:parameters (?v10 ?v7 ?v4)
:precondition (and (pred_1 ?v10) (pred_7 ?v7) (pred_7 ?v4)
                  (pred_10 ?v10) (pred_12 ?v4) (pred_8 ?v7 ?v10))
:effect (and (pred_12 ?v7) (pred_8 ?v4 ?v10)
        (not (pred_12 ?v4)) (not (pred_8 ?v7 ?v10))))

(:action op_5
:parameters (?v10 ?v9)
:precondition (and (pred_1 ?v10) (pred_7 ?v9) 
                  (pred_10 ?v10) (pred_12 ?v9))
:effect (and (pred_9 ) (pred_8 ?v9 ?v10) (not (pred_12 ?v9)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_23 obj_13 obj_22 obj_11 obj_29 obj_03 obj_31 obj_18 obj_27 obj_02 obj_09 obj_08 obj_20 obj_01 obj_12 obj_21 obj_26 obj_28 obj_14 obj_19 obj_05 obj_06 obj_24 obj_30
    obj_04 obj_16 obj_25
    obj_07 obj_10 obj_15
    )

    (:init
       (pred_9)

       (pred_1 obj_17)
       (pred_1 obj_23)
       (pred_1 obj_13)
       (pred_1 obj_22)
       (pred_1 obj_11)
       (pred_1 obj_29)
       (pred_1 obj_03)
       (pred_1 obj_31)
       (pred_1 obj_18)
       (pred_1 obj_27)
       (pred_1 obj_02)
       (pred_1 obj_09)
       (pred_1 obj_08)
       (pred_1 obj_20)
       (pred_1 obj_01)
       (pred_1 obj_12)
       (pred_1 obj_21)
       (pred_1 obj_26)
       (pred_1 obj_28)
       (pred_1 obj_14)
       (pred_1 obj_19)
       (pred_1 obj_05)
       (pred_1 obj_06)
       (pred_1 obj_24)
       (pred_1 obj_30)
       (pred_4 obj_04)
       (pred_4 obj_16)
       (pred_4 obj_25)
       (pred_7 obj_07)
       (pred_7 obj_10)
       (pred_7 obj_15)

       (pred_2 obj_17 obj_29)
       (pred_2 obj_17 obj_23)
       (pred_2 obj_23 obj_03)
       (pred_2 obj_23 obj_13)
       (pred_2 obj_23 obj_17)
       (pred_2 obj_13 obj_31)
       (pred_2 obj_13 obj_22)
       (pred_2 obj_13 obj_23)
       (pred_2 obj_22 obj_18)
       (pred_2 obj_22 obj_11)
       (pred_2 obj_22 obj_13)
       (pred_2 obj_11 obj_27)
       (pred_2 obj_11 obj_22)
       (pred_2 obj_29 obj_02)
       (pred_2 obj_29 obj_03)
       (pred_2 obj_29 obj_17)
       (pred_2 obj_03 obj_09)
       (pred_2 obj_03 obj_31)
       (pred_2 obj_03 obj_23)
       (pred_2 obj_03 obj_29)
       (pred_2 obj_31 obj_08)
       (pred_2 obj_31 obj_18)
       (pred_2 obj_31 obj_13)
       (pred_2 obj_31 obj_03)
       (pred_2 obj_18 obj_20)
       (pred_2 obj_18 obj_27)
       (pred_2 obj_18 obj_22)
       (pred_2 obj_18 obj_31)
       (pred_2 obj_27 obj_01)
       (pred_2 obj_27 obj_11)
       (pred_2 obj_27 obj_18)
       (pred_2 obj_02 obj_12)
       (pred_2 obj_02 obj_09)
       (pred_2 obj_02 obj_29)
       (pred_2 obj_09 obj_21)
       (pred_2 obj_09 obj_08)
       (pred_2 obj_09 obj_03)
       (pred_2 obj_09 obj_02)
       (pred_2 obj_08 obj_26)
       (pred_2 obj_08 obj_20)
       (pred_2 obj_08 obj_31)
       (pred_2 obj_08 obj_09)
       (pred_2 obj_20 obj_28)
       (pred_2 obj_20 obj_01)
       (pred_2 obj_20 obj_18)
       (pred_2 obj_20 obj_08)
       (pred_2 obj_01 obj_14)
       (pred_2 obj_01 obj_27)
       (pred_2 obj_01 obj_20)
       (pred_2 obj_12 obj_19)
       (pred_2 obj_12 obj_21)
       (pred_2 obj_12 obj_02)
       (pred_2 obj_21 obj_05)
       (pred_2 obj_21 obj_26)
       (pred_2 obj_21 obj_09)
       (pred_2 obj_21 obj_12)
       (pred_2 obj_26 obj_06)
       (pred_2 obj_26 obj_28)
       (pred_2 obj_26 obj_08)
       (pred_2 obj_26 obj_21)
       (pred_2 obj_28 obj_24)
       (pred_2 obj_28 obj_14)
       (pred_2 obj_28 obj_20)
       (pred_2 obj_28 obj_26)
       (pred_2 obj_14 obj_30)
       (pred_2 obj_14 obj_01)
       (pred_2 obj_14 obj_28)
       (pred_2 obj_19 obj_05)
       (pred_2 obj_19 obj_12)
       (pred_2 obj_05 obj_06)
       (pred_2 obj_05 obj_21)
       (pred_2 obj_05 obj_19)
       (pred_2 obj_06 obj_24)
       (pred_2 obj_06 obj_26)
       (pred_2 obj_06 obj_05)
       (pred_2 obj_24 obj_30)
       (pred_2 obj_24 obj_28)
       (pred_2 obj_24 obj_06)
       (pred_2 obj_30 obj_14)
       (pred_2 obj_30 obj_24)
       (pred_11 obj_27)
       (pred_11 obj_17)
       (pred_11 obj_08)
       (pred_6  obj_27 obj_04)
       (pred_6  obj_17 obj_16)
       (pred_6  obj_08 obj_25)
       (pred_3 obj_23)
       (pred_3 obj_13)
       (pred_3 obj_22)
       (pred_3 obj_11)
       (pred_3 obj_29)
       (pred_3 obj_03)
       (pred_3 obj_31)
       (pred_3 obj_18)
       (pred_3 obj_02)
       (pred_3 obj_09)
       (pred_3 obj_20)
       (pred_3 obj_01)
       (pred_3 obj_12)
       (pred_3 obj_21)
       (pred_3 obj_26)
       (pred_3 obj_28)
       (pred_3 obj_14)
       (pred_3 obj_19)
       (pred_3 obj_05)
       (pred_3 obj_06)
       (pred_3 obj_24)
       (pred_3 obj_30)

       (pred_5  obj_07 obj_04)
       (pred_5  obj_10 obj_16)
       (pred_5  obj_15 obj_25)
       (pred_8 obj_07 obj_11)
       (pred_8 obj_10 obj_14)
       (pred_8 obj_15 obj_13)
       (pred_10 obj_19)
    )

    (:goal (and
       (pred_8 obj_07 obj_21)
       (pred_8 obj_10 obj_30)
       (pred_8 obj_15 obj_06)
    ))
(:constraints
  (always (not (pred_10 obj_28)))
)
)

; plan
1. (op_2 obj_19 obj_12)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_12)
   goals met: 0 of 3
2. (op_2 obj_12 obj_21)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_21)
   goals met: 0 of 3
3. (op_2 obj_21 obj_09)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_09)
   goals met: 0 of 3
4. (op_2 obj_09 obj_03)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_03)
   goals met: 0 of 3
5. (op_2 obj_03 obj_31)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_31)
   goals met: 0 of 3
6. (op_2 obj_31 obj_18)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_18)
   goals met: 0 of 3
7. (op_2 obj_18 obj_20)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_20)
   goals met: 0 of 3
8. (op_2 obj_20 obj_01)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_01)
   goals met: 0 of 3
9. (op_2 obj_01 obj_14)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_14)
   goals met: 0 of 3
10. (op_1 obj_14 obj_10)
   deleted: (pred_8 obj_10 obj_14) (pred_9)
   added: (pred_12 obj_10)
   goals met: 0 of 3
11. (op_2 obj_14 obj_30)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_30)
   goals met: 0 of 3
12. (op_5 obj_30 obj_10)
   deleted: (pred_12 obj_10)
   added: (pred_9) (pred_8 obj_10 obj_30)
   goals met: 1 of 3
13. (op_2 obj_30 obj_14)
   deleted: (pred_10 obj_30)
   added: (pred_10 obj_14)
   goals met: 1 of 3
14. (op_2 obj_14 obj_01)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_01)
   goals met: 1 of 3
15. (op_2 obj_01 obj_20)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_20)
   goals met: 1 of 3
16. (op_2 obj_20 obj_18)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_18)
   goals met: 1 of 3
17. (op_2 obj_18 obj_31)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_31)
   goals met: 1 of 3
18. (op_2 obj_31 obj_13)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_13)
   goals met: 1 of 3
19. (op_1 obj_13 obj_15)
   deleted: (pred_8 obj_15 obj_13) (pred_9)
   added: (pred_12 obj_15)
   goals met: 1 of 3
20. (op_2 obj_13 obj_22)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_22)
   goals met: 1 of 3
21. (op_2 obj_22 obj_11)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_11)
   goals met: 1 of 3
22. (op_4 obj_11 obj_07 obj_15)
   deleted: (pred_12 obj_15) (pred_8 obj_07 obj_11)
   added: (pred_12 obj_07) (pred_8 obj_15 obj_11)
   goals met: 1 of 3
23. (op_2 obj_11 obj_22)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_22)
   goals met: 1 of 3
24. (op_2 obj_22 obj_13)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_13)
   goals met: 1 of 3
25. (op_2 obj_13 obj_23)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_23)
   goals met: 1 of 3
26. (op_2 obj_23 obj_03)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_03)
   goals met: 1 of 3
27. (op_2 obj_03 obj_09)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_09)
   goals met: 1 of 3
28. (op_2 obj_09 obj_21)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_21)
   goals met: 1 of 3
29. (op_5 obj_21 obj_07)
   deleted: (pred_12 obj_07)
   added: (pred_9) (pred_8 obj_07 obj_21)
   goals met: 2 of 3
30. (op_2 obj_21 obj_09)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_09)
   goals met: 2 of 3
31. (op_2 obj_09 obj_03)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_03)
   goals met: 2 of 3
32. (op_2 obj_03 obj_31)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_31)
   goals met: 2 of 3
33. (op_2 obj_31 obj_18)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_18)
   goals met: 2 of 3
34. (op_2 obj_18 obj_22)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_22)
   goals met: 2 of 3
35. (op_2 obj_22 obj_11)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_11)
   goals met: 2 of 3
36. (op_1 obj_11 obj_15)
   deleted: (pred_8 obj_15 obj_11) (pred_9)
   added: (pred_12 obj_15)
   goals met: 2 of 3
37. (op_2 obj_11 obj_22)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_22)
   goals met: 2 of 3
38. (op_2 obj_22 obj_18)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_18)
   goals met: 2 of 3
39. (op_2 obj_18 obj_20)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_20)
   goals met: 2 of 3
40. (op_3 obj_20 obj_08 obj_15 obj_25)
   deleted: (pred_11 obj_08)
   added: (pred_3 obj_08)
   goals met: 2 of 3
41. (op_2 obj_20 obj_08)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_08)
   goals met: 2 of 3
42. (op_2 obj_08 obj_26)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_26)
   goals met: 2 of 3
43. (op_2 obj_26 obj_06)
   deleted: (pred_10 obj_26)
   added: (pred_10 obj_06)
   goals met: 2 of 3
44. (op_5 obj_06 obj_15)
   deleted: (pred_12 obj_15)
   added: (pred_9) (pred_8 obj_15 obj_06)
   goals met: 3 of 3
